#include "support.h"
//----------------------- переменные из других файлов --------------------------------//
//----------------------- переменные из этого файла ----------------------------------//

//------------------------------ функции ---------------------------------------------//
int32_t map(int32_t x, int32_t in_min, int32_t in_max, int32_t out_min, int32_t out_max) {
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

int32_t constrain(int32_t x, int32_t min, int32_t max) {
  if (x < min) {
    return min;
  } else if (x > max) {
    return max;
  } else {
    return x;
  }
}

//------------------------------ примечания ------------------------------------------//
